Autodesk.Revit.DB.BooleanOperationsType
An enumerated type listing boolean types that are supported for boolean operation.
Since:
2012

Autodesk.Revit.DB.BooleanOperationsType.Intersect
Intersect.

Autodesk.Revit.DB.BooleanOperationsType.Difference
Difference.

Autodesk.Revit.DB.BooleanOperationsType.Union
Union.